Repository: vikasagarwal11/beforedoctor
Catalog: beforedoctor/lib/l10n/app_*.arb
Languages: es, fr, hi, zh

# app_title
source: Dr. Healthie
fr: AvantLeMédecin
hi: डॉक्टर से पहले
zh: 看医生前

# app_subtitle
source: Voice-Driven Health App
es: Aplicación de Salud por Voz
fr: Application de Santé Pilotée par la Voix
hi: आवाज से चलने वाला स्वास्थ्य ऐप
zh: 语音驱动健康应用

# mic_button_listening
source: Listening
es: Escuchando
fr: Écoute
hi: सुन रहा है
zh: 正在听

# mic_button_ready
source: Tap to talk
es: Toca para hablar
fr: Appuyez pour parler
hi: बात करने के लिए टैप करें
zh: 点击说话

# mic_button_listening_hint
source: Hold the button to stop listening.
es: Mantén presionado el botón para dejar de escuchar.
fr: Maintenez le bouton enfoncé pour arrêter d'écouter.
hi: सुनना बंद करने के लिए बटन को लंबे समय तक दबाएं।
zh: 长按按钮停止听。

# mic_button_ready_hint
source: Tap once and then speak.
es: Toca una vez y luego habla.
fr: Appuyez une fois puis parlez.
hi: एक बार टैप करें और फिर बोलें।
zh: 点击一次然后说话。

# mic_button_accessibility
source: Microphone button for voice input
es: Botón del micrófono para entrada de voz
fr: Bouton du microphone pour saisie vocale
hi: आवाज इनपुट के लिए माइक्रोफोन बटन
zh: 语音输入麦克风按钮

# status_ready
source: Ready
es: Listo
fr: Prêt
hi: तैयार
zh: 就绪

# status_listening_child
source: I'm listening
es: Te estoy escuchando
fr: Je t'écoute
hi: मैं सुन रहा हूं
zh: 我在听

# status_listening_parent
source: Listening
es: Escuchando
fr: Écoute
hi: सुन रहा है
zh: 正在听

# status_processing_child
source: Thinking...
es: Pensando...
fr: Je réfléchis...
hi: सोच रहा हूं...
zh: 思考中...

# status_processing_parent
source: Processing...
es: Procesando...
fr: Traitement...
hi: प्रोसेसिंग...
zh: 处理中...

# status_speaking_child
source: Let me tell you
es: Déjame contarte
fr: Laisse-moi te dire
hi: मुझे बताने दो
zh: 让我告诉你

# status_speaking_parent
source: Speaking...
es: Hablando...
fr: Parle...
hi: बोल रहा है...
zh: 说话中...

# status_complete_child
source: All done!
es: ¡Todo listo!
fr: C'est fini !
hi: हो गया!
zh: 完成了！

# status_complete_parent
source: Complete
es: Completado
fr: Terminé
hi: पूरा
zh: 完成

# status_concern_child
source: Let's tell a grown-up
es: Vamos a contarle a un adulto
fr: Disons-le à un adulte
hi: चलो बड़ों को बताते हैं
zh: 让我们告诉大人

# status_concern_parent
source: Concern noted
es: Preocupación anotada
fr: Préoccupation notée
hi: चिंता दर्ज की गई
zh: 已记录关注

# character_state
source: Character
es: Personaje
fr: Personnage
hi: पात्र
zh: 角色

# language_label
source: Language
es: Idioma
fr: Langue
hi: भाषा
zh: 语言

# status_label
source: Status
es: Estado
fr: État
hi: स्थिति
zh: 状态

# conversation_header
source: Conversation
es: Conversación
hi: बातचीत
zh: 对话

# conversation_start
source: Tap "Start Conversation" to begin
es: Toca "Iniciar Conversación" para comenzar
fr: Appuyez sur "Commencer la Conversation" pour commencer
hi: शुरू करने के लिए "बातचीत शुरू करें" पर टैप करें
zh: 点击"开始对话"开始

# conversation_you_said
source: You said:
es: Dijiste:
fr: Vous avez dit :
hi: आपने कहा:
zh: 你说：

# conversation_response
source: Response:
es: Respuesta:
fr: Réponse :
hi: जवाब:
zh: 回复：

# conversation_processing
source: Processing...
es: Procesando...
fr: Traitement...
hi: प्रोसेसिंग...
zh: 处理中...

# error_loading_model
source: Error Loading 3D Model
es: Error al Cargar Modelo 3D
fr: Erreur de Chargement du Modèle 3D
hi: 3D मॉडल लोड करने में त्रुटि
zh: 加载3D模型错误

source: Loading 3D Character...
es: Cargando Personaje 3D...
fr: Chargement du Personnage 3D...
hi: 3D पात्र लोड हो रहा है...
zh: 加载3D角色中...

source: Selected: {character}
es: Seleccionado: {character}
fr: Sélectionné : {character}
hi: चयनित: {character}
zh: 已选择：{character}

source: Start Conversation
es: Iniciar Conversación
fr: Commencer la Conversation
hi: बातचीत शुरू करें
zh: 开始对话

source: Stop Listening
es: Dejar de Escuchar
fr: Arrêter d'Écouter
hi: सुनना बंद करें
zh: 停止听

# audience_kid
source: Kid Mode
es: Modo Niño
fr: Mode Enfant
hi: बच्चा मोड
zh: 儿童模式

# audience_parent
source: Parent Mode
es: Modo Padre
fr: Mode Parent
hi: माता-पिता मोड
zh: 家长模式

# page_chat
source: Chat
hi: चैट
zh: 聊天

# page_insights
source: Insights
es: Información
fr: Aperçus
hi: अंतर्दृष्टि
zh: 洞察

# page_log
source: Log
es: Registro
fr: Journal
hi: लॉग
zh: 记录

# page_settings
source: Settings
es: Configuración
fr: Paramètres
hi: सेटिंग्स
zh: 设置

# prompt_1_child
source: Say 'ouch' if something hurts
es: Di 'ay' si algo te duele
fr: Dis 'aïe' si quelque chose fait mal
hi: अगर कुछ दर्द करता है तो 'आह' कहो
zh: 如果疼就说'哎哟'

# prompt_2_child
source: Tell me what's bothering you
es: Dime qué te molesta
fr: Dis-moi ce qui te dérange
hi: मुझे बताओ क्या परेशान कर रहा है
zh: 告诉我什么让你烦恼

# prompt_3_child
source: Point and tell me where it hurts
es: Señala y dime dónde te duele
fr: Montre et dis-moi où ça fait mal
hi: इशारा करो और बताओ कहां दर्द करता है
zh: 指一指告诉我哪里疼

# prompt_4_child
source: Is it a little, medium, or a lot?
es: ¿Es poco, medio o mucho?
fr: C'est un peu, moyen ou beaucoup ?
hi: क्या यह थोड़ा, मध्यम या बहुत है?
zh: 是一点、中等还是很多？

# prompt_5_child
source: Any other tummy or throat feelings?
es: ¿Otras sensaciones en la barriga o garganta?
fr: D'autres sensations dans le ventre ou la gorge ?
hi: पेट या गले में कोई और भावना?
zh: 肚子或喉咙有其他感觉吗？

# prompt_1_parent
source: Describe the symptom in your own words
es: Describe el síntoma con tus propias palabras
fr: Décrivez le symptôme avec vos propres mots
hi: अपने शब्दों में लक्षण का वर्णन करें
zh: 用你自己的话描述症状

# prompt_2_parent
source: How long has this been going on?
es: ¿Cuánto tiempo lleva pasando?
fr: Depuis combien de temps cela dure-t-il ?
hi: यह कब से चल रहा है?
zh: 这种情况持续多久了？

# prompt_3_parent
source: Any fever, rash, vomiting, or trouble breathing?
es: ¿Fiebre, sarpullido, vómitos o dificultad para respirar?
fr: Fièvre, éruption, vomissements ou difficulté à respirer ?
hi: बुखार, चकत्ते, उल्टी या सांस लेने में तकलीफ?
zh: 有发烧、皮疹、呕吐或呼吸困难吗？

# prompt_4_parent
source: Anything that makes it better or worse?
es: ¿Algo que lo mejore o empeore?
fr: Quelque chose qui l'améliore ou l'aggrave ?
hi: कुछ ऐसा जो इसे बेहतर या बदतर बनाता है?
zh: 有什么会让它变好或变坏吗？

# feedback_1_child
source: Got it! I'm thinking...
es: ¡Entendido! Estoy pensando...
fr: Compris ! Je réfléchis...
hi: समझ गया! मैं सोच रहा हूं...
zh: 明白了！我在思考...

# feedback_2_child
source: Thanks! I'll tell you what I think.
es: ¡Gracias! Te diré qué pienso.
fr: Merci ! Je vais te dire ce que je pense.
hi: धन्यवाद! मैं आपको बताऊंगा कि मैं क्या सोचता हूं।
zh: 谢谢！我会告诉你我的想法。

# feedback_3_child
source: Nice job. Let's try one more question.
es: Buen trabajo. Probemos una pregunta más.
fr: Bon travail. Essayons une autre question.
hi: अच्छा काम। एक और सवाल आज़माते हैं।
zh: 做得好。让我们再试一个问题。

# feedback_1_parent
source: Heard you. Analyzing now...
es: Te escuché. Analizando ahora...
fr: Entendu. Analyse en cours...
hi: सुना। अभी विश्लेषण कर रहा हूं...
zh: 听到了。正在分析...

# feedback_2_parent
source: Here's what I'm seeing.
es: Esto es lo que estoy viendo.
fr: Voici ce que je vois.
hi: यह मैं देख रहा हूं।
zh: 这是我看到的。

# feedback_3_parent
source: One follow-up to make it clearer.
es: Una pregunta más para aclararlo.
fr: Une question de plus pour clarifier.
hi: एक और सवाल स्थिति को स्पष्ट करने के लिए।
zh: 再问一个让情况更清楚。

# concern_child
source: Let's tell a grown-up right away.
es: Vamos a contarle a un adulto ahora mismo.
fr: Disons-le à un adulte tout de suite.
hi: चलो अभी बड़ों को बताते हैं।
zh: 让我们马上告诉大人。

# concern_parent
source: This might need prompt attention. Consider calling your pediatrician or urgent care.
es: Esto podría necesitar atención inmediata. Considera llamar a tu pediatra o urgencias.
fr: Cela pourrait nécessiter une attention immédiate. Considérez appeler votre pédiatre ou les urgences.
hi: इसे तत्काल ध्यान की आवश्यकता हो सकती है। अपने बाल रोग विशेषज्ञ या आपातकालीन देखभाल को कॉल करने पर विचार करें।
zh: 这可能需要及时关注。考虑联系儿科医生或急诊。

# a11y_tap_to_talk_label
source: Tap to talk
es: Toca para hablar
fr: Appuyez pour parler
hi: बात करने के लिए टैप करें
zh: 点击说话

# a11y_tap_to_talk_hint
source: Tap once and then speak
es: Toca una vez y luego habla
fr: Appuyez une fois puis parlez
hi: एक बार टैप करें और फिर बोलें
zh: 点击一次然后说话

# a11y_listening_label
source: Listening. Long press to stop.
es: Escuchando. Mantén presionado para parar.
fr: Écoute. Appuyez longuement pour arrêter.
hi: सुन रहा है। रोकने के लिए लंबे समय तक दबाएं।
zh: 正在听。长按停止。

# a11y_listening_hint
source: Hold the button to stop listening.
es: Mantén el botón para dejar de escuchar.
fr: Maintenez le bouton pour arrêter d'écouter.
hi: सुनना बंद करने के लिए बटन को पकड़ें.
zh: 按住按钮停止听。
